app/views/shared/_postCard.html.erb

SELECT "posts".* FROM "posts"
---
<% postCard[:posts].each do |post| %>