app/controllers/posts_controller.rb

INSERT INTO "posts" ("body", "created_at", "title", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", nil], ["created_at", Tue, 07 May 2013 15:12:44 UTC +00:00], ["title", nil], ["updated_at", Tue, 07 May 2013 15:12:44 UTC +00:00], ["user_id", 1]]
---
def create
  @post = Post.new(params[:post])
  if @post.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" IS NULL LIMIT 1
---
def show
  @post = Post.find_by_id(params[:id])

SELECT "posts".* FROM "posts" WHERE "posts"."id" = 6 LIMIT 1
UPDATE "posts" SET "picture_file_name" = 'brandonHeadshot.png', "picture_content_type" = 'image/png', "picture_file_size" = 116373, "picture_updated_at" = '2013-05-07 17:21:44.237826', "updated_at" = '2013-05-07 17:21:44.653771' WHERE "posts"."id" = 11
---
def update
  @post = Post.find_by_id(params[:id])
  if @post.update_attributes(params[:post])

SELECT "posts".* FROM "posts"
---
def index
  @posts = Post.all.sort_by { |post| post.created_at }.reverse

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", "1"]]
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 1]]
---
def destroy
  @post = Post.find(params[:id])
  @title = @post.title
  if @post.destroy