app/controllers/users_controller.rb

INSERT INTO "users" ("admin", "created_at", "email", "name", "password_digest", "remember_token", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
def create
  @user = User.new(params[:user])
  if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = 1
---
def show
  if User.find_by_id(params[:id])
    @user = User.find_by_id(params[:id])
    @posts = Post.all

UPDATE "users" SET "password_digest" = '$2a$10$7zOtthb/7NiPvrrAhSEK.ua4IYn6jbJjcombJBoreWMz7YX9weTYG', "remember_token" = '1wxT5oTM4WCUSWa88V0HLQ', "updated_at" = '2013-03-25 00:53:35.722972' WHERE "users"."id" = 1
---
def update
  if @user.update_attributes(params[:user])

SELECT "users".* FROM "users" WHERE "users"."id" = 'id' LIMIT 1
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 9]]
---
def destroy
  @user = User.find_by_id(params[:id])
  @user.destroy